In [1]:
import pandas as pd

In [4]:
friend_dict_list = [
    {'name':'aaa','age' : 25 , 'job':'programmer'},
    {'name':'bbb','age' : 26 , 'job':'student'}
]

In [8]:
#딕셔너리형 데이터 프레임은 컬럼의 순서를 보장해주지 않는다.
df = pd.DataFrame(friend_dict_list)

df

  name  age         job
0  aaa   25  programmer
1  bbb   26     student

In [7]:
df = df[['name','age','job']]
df

  name  age         job
0  aaa   25  programmer
1  bbb   26     student

In [9]:
# 키의 순서를 보장하는 사전 리스트
from collections import OrderedDict

In [13]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['john','nate']),
        ('age', [25, 26]),
        ('job', ['programmer','student']),
    ]
)

In [14]:
df_ordered = pd.DataFrame(friend_ordered_dict)
df_ordered

   name  age         job
0  john   25  programmer
1  nate   26     student

In [16]:
friend_list = [
    ['John', 20,'student'],
    ['nate', 30,'teather']
]

column_name = ['name','age','job']

In [19]:
df_list = pd.DataFrame.from_records(friend_list, columns = column_name )